In [34]:
import pandas as pd
import numpy as np

In [4]:
# pd.Series(값 목록, [인덱스])
s = pd.Series([5,10,15,20])
print(s)
# 시리즈 생성시 인덱스를 따로 설정하지 않으면
# 자동으로 생성된다.

0     5
1    10
2    15
3    20
dtype: int64

In [13]:
s = pd.Series([70,80,90], index = ['국어','영어','수학'])
print(s.loc['국어'])
s.loc['수학'] = 75
print(s.loc['수학'])

70
75

In [20]:
s = pd.Series([15,27,18], index = ['봄','여름','가을'])
print(s)
print(s.loc['봄'])
s.loc['가을'] = 20
s

봄     15
여름    27
가을    18
dtype: int64
15

봄     15
여름    27
가을    20
dtype: int64

In [24]:
s = pd.Series([1000,1200,1300], index = ['01-01','01-02','01-03'])
print(s)
print(s.loc['01-01'])
s.loc['01-02'] = 1250
s

01-01    1000
01-02    1200
01-03    1300
dtype: int64
1000

01-01    1000
01-02    1250
01-03    1300
dtype: int64

In [27]:
s = pd.Series([300,400,500], index = ['월','화','수'])
print(s)
print(s.loc['화'])
s.loc['수'] = 550
s

월    300
화    400
수    500
dtype: int64
400

월    300
화    400
수    550
dtype: int64

In [31]:
data = {'name' : ['철수','영희','민수'], 'math' : [85,90,78]}
df = pd.DataFrame(data)
print(df)
print(df.index)
print(df.columns)

  name  math
0   철수    85
1   영희    90
2   민수    78
RangeIndex(start=0, stop=3, step=1)
Index(['name', 'math'], dtype='object')

In [29]:
data = {'day' : ['월','화','수'], 'sales' : [1000,1200,900]}
df = pd.DataFrame(data)
df

  day  sales
0   월   1000
1   화   1200
2   수    900

In [36]:
data = np.array([[30,50],[20,40]])
df = pd.DataFrame(data, index = ['사과', '배'], columns = ['판매량', '재고'])
df

    판매량  재고
사과   30  50
배    20  40

In [38]:
print(df.loc['사과','판매량'])

30

In [39]:
df['가격'] = [1000,1200]
df

    판매량  재고    가격
사과   30  50  1000
배    20  40  1200

In [40]:
data = np.array([[950,1200],[500,800]])
df = pd.DataFrame(data, index = ['서울','부산'], columns = ['인구','면적'])
df

     인구    면적
서울  950  1200
부산  500   800

In [41]:
df.loc['서울','면적']

np.int64(1200)

In [42]:
df['특산물'] = ['김치','어묵']
df

     인구    면적 특산물
서울  950  1200  김치
부산  500   800  어묵

In [43]:
data = np.array([[15000, '홍길동전'],[20000, '해리포터']])
df = pd.DataFrame(data, index = ['책1','책2'], columns = ['가격','제목'])
df

       가격    제목
책1  15000  홍길동전
책2  20000  해리포터

In [44]:
df.loc['책2','가격']

'20000'

In [47]:
df['저자'] = ['허균','J.K.롤링']
df

       가격    제목      저자
책1  15000  홍길동전      허균
책2  20000  해리포터  J.K.롤링

In [48]:
data = np.array([[9.0, 14000],[8.2, 9500]])
df = pd.DataFrame(data, index = ['기생충','인터스텔라'], columns = ['평점','관객수'])
df

        평점      관객수
기생충    9.0  14000.0
인터스텔라  8.2   9500.0

In [49]:
df.loc['기생충','평점']

np.float64(9.0)

In [53]:
result = df.drop('관객수', axis = 1)
print(df)
result

        평점      관객수
기생충    9.0  14000.0
인터스텔라  8.2   9500.0

        평점
기생충    9.0
인터스텔라  8.2

In [59]:
s = pd.Series([80,90,75,85], index = ['국어','영어','수학','과학'])
print(s.sum())
print(s.mean())
print(s.max())
print(s.min())
s

330
82.5
90
75

국어    80
영어    90
수학    75
과학    85
dtype: int64

In [63]:
s = pd.Series([2,5,-1,0,7,-3,4], index = ['월','화','수','목','금','토','일'])
s[s >= 0]

월    2
화    5
목    0
금    7
일    4
dtype: int64

In [65]:
data = np.array([[12000,9.0],[8000,8.5],[15000,9.3]])
df = pd.DataFrame(data, index = ['기생충','인터스텔라','아바타'], columns = ['관객수','평점'])
df

           관객수   평점
기생충    12000.0  9.0
인터스텔라   8000.0  8.5
아바타    15000.0  9.3

In [67]:
df['관객수'] + 1000

기생충      13000.0
인터스텔라     9000.0
아바타      16000.0
Name: 관객수, dtype: float64

In [69]:
df[df['평점'] >= 9.0]

         관객수   평점
기생충  12000.0  9.0
아바타  15000.0  9.3

In [94]:
data = np.array([[25000,30000],[40000,15000]])
df = pd.DataFrame(data, index = ['치마','바지'], columns = ['1월 매출','2월 매출'])
print(df.sum(axis = 1))
df

치마    55000
바지    55000
dtype: int64

    1월 매출  2월 매출
치마  25000  30000
바지  40000  15000

In [101]:
df['합계'] = df['1월 매출'] + df['2월 매출']
df['합계(만원)'] = df['합계'] / 10000
df

    1월 매출  2월 매출     합계  합계(만원)
치마  25000  30000  55000     5.5
바지  40000  15000  55000     5.5

In [113]:
data = np.array([[20,25,15],[18,22,19],[25,27,23]])
df = pd.DataFrame(data, index = ['서울','대구','부산'], columns = ['봄','여름','겨울'])
df

     봄  여름  겨울
서울  20  25  15
대구  18  22  19
부산  25  27  23

In [114]:
df.loc['서울','여름'] = np.nan
df = df.dropna(axis = 0)

In [115]:
df.loc['부산','봄'] = np.nan
df

       봄    여름  겨울
대구  18.0  22.0  19
부산   NaN  27.0  23

In [119]:
df.fillna(0)

       봄    여름  겨울
대구  18.0  22.0  19
부산   0.0  27.0  23

In [123]:
data = np.array([[80,75,90],[85,88,82],[70,65,78]])
df = pd.DataFrame(data, index = ['국어','영어','수학'], columns = ['1반','2반','3반'])
df

    1반  2반  3반
국어  80  75  90
영어  85  88  82
수학  70  65  78

In [124]:
df.loc['영어','2반'] = np.nan
df = df.dropna(axis = 0)
df

    1반    2반  3반
국어  80  75.0  90
수학  70  65.0  78

In [126]:
df.loc['수학','3반'] = np.nan
df.fillna(100)

    1반    2반     3반
국어  80  75.0   90.0
수학  70  65.0  100.0